trade/src/InformationRegisters/НастройкиПодключенияЛокальныхМодулейИСМП/НастройкиПодключенияЛокальныхМодулейИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПодключенияЛокальныхМодулейИСМП</name>
  <resources>
    <name>АдресПодключенияЛМ</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбменНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НастроенныеТоварныеГруппы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоДнейВыгрузкиКарточек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СерверПодключенияЛМ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортПодключенияЛМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>DefinedType.РабочиеМестаИС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/НастройкиПодключенияЛокальныхМодулейИСМП/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает прочитанный пароль администратора из безопасного хранилища по данным записи регистра
// 
// Параметры:
//  ХешСумма - Строка - хеш сумма настроек подключения, определяющие пароль
// 
// Возвращаемое значение:
//  Произвольный, Структура, Неопределено - Пароль администратора из безопасного хранилища
Функция ПарольАдминистратораИзБезопасногоХранилища(ХешСумма) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пароль = ПрочитатьПарольАдминистратораИзБезопасногоХранилища(ХешСумма);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Пароль;
	
КонецФункции

// Процедура сохраняет пароль администратора в безопасное хранилище под данными регистра
// 
// Параметры:
//  ХешСумма - Строка - хеш сумма настроек подключения, определяющие пароль
//  Пароль - Строка - установленный пароль
Процедура СохранитьПарольАдминистратораВБезопасноеХранилище(ХешСумма, Пароль) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписатьПарольАдминистратораВБезопасноеХранилище(ХешСумма, Пароль);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Конструктор записи владельца пароля и расчета хеша
// 
// Возвращаемое значение:
//  Структура - Конструктор записи владельца пароля:
// * РабочееМесто - Произвольный, Неопределено - рабочее место
// * АдресПодключенияЛМ - Строка - строка подключения
Функция КонструкторЗаписиВладельцаПароля() Экспорт
	
	СтруктураВозврата = Новый Структура();
	
	СтруктураВозврата.Вставить("РабочееМесто",       ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа(Метаданные.ОпределяемыеТипы.РабочиеМестаИС));
	СтруктураВозврата.Вставить("АдресПодключенияЛМ", "");
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НомерПриоритетаНастройкиПодключения(Организация, РабочееМесто) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПодключенияЛокальныхМодулейИСМП.Приоритет КАК Приоритет
		|ИЗ
		|	РегистрСведений.НастройкиПодключенияЛокальныхМодулейИСМП КАК НастройкиПодключенияЛокальныхМодулейИСМП
		|ГДЕ
		|	НастройкиПодключенияЛокальныхМодулейИСМП.Организация = &Организация
		|	И НастройкиПодключенияЛокальныхМодулейИСМП.РабочееМесто = &РабочееМесто
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет УБЫВ";
	
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Приоритет + 1;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПрочитатьПарольАдминистратораИзБезопасногоХранилища(ХешСумма)
	
	Возврат ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ХешСумма);
	
КонецФункции

Процедура ЗаписатьПарольАдминистратораВБезопасноеХранилище(ХешСумма, Пароль)
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ХешСумма, Пароль);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
